#include <iostream>
#include <string>
using namespace std;
/***
 *   3   1    2  4
 *   3+1  1+2 4+2
 * (3+1)+(1+2)  (1+2)+(4+2)
 *  (3+1)+(1+2)+(1+2)+(4+2)
 *  3:  1
 *  1:  3
 *  2:  3
 *  4:  1
 *
 * 1        2      3        4       5
 *      1+2     2+3     3+4     4+5
 *        1+2+2+3   2+3+3+4  3+4+4+5
 *        1+2+2+3+2+3+3+4    2+3+3+4+3+4+4+5
 *             1+2+2+3+2+3+3+4+2+3+3+4+3+4+4+5
 * 1,5:   １
 * ２,4:    4=
 * 3:       6=1+2+3
 *
 *      在没有遇到边界阻碍的情况下，每个数在下一层出现次数ｘ２
 *          遇到阻碍后增速放缓，
 **/

int main() {
    string arr[100][100];
    arr[0][0] = "";
    arr[0][1] = "a";
    arr[0][2] = "b";
    arr[0][3] = "c";
    arr[0][4] = "d";
    arr[0][5] = "e";
    arr[0][6] = "f";
    arr[0][7] = "g";
    arr[0][8] = "h";

    for (int i = 1; i <= 8; i++) {
        for (int j = 1; j < 8 - i; j++) {
            arr[i][j] = arr[i - 1][j] + arr[i - 1][j + 1];
            cout << arr[i][j] << "  ";
        }
        cout << endl;
    }
    return 0;
}